*** make sure the meaning of index/search analyzer
:LOGBOOK:
CLOCK: [2015-08-25 周二 14:52]--[2015-09-02 周三 17:13] => 194:21
** DONE send the documents from kedaxunfei to haizi
CLOSED: [2015-08-26 周三 14:00]
大体上有个数了,个人觉得应该是不靠谱，给 haizi 看看再说吧
:LOGBOOK:
CLOCK: [2015-08-26 周三 13:42]--[2015-08-26 周三 14:00] =>  0:18
:END:
** DONE 1. programe python to delete data in xunfy, choice : request or scrapy.request
CLOSED: [2015-08-31 周一 17:13]
CLOCK: [2015-08-31 周一 11:04]--[2015-08-31 周一 11:29] =>  0:25
CLOCK: [2015-08-31 周一 10:26]--[2015-08-31 周一 10:51] =>  0:25
<2015-08-31 周一 10:26>
*** DONE learn how to use burpsuite to intercept 
CLOSED: [2015-08-31 周一 14:57]
CLOCK: [2015-08-31 周一 14:23]--[2015-08-31 周一 14:48] =>  0:25
** DONE write email to Teacher Cheng
CLOSED: [2015-09-03 周四 09:57]
:LOGBOOK:
CLOCK: [2015-09-03 周四 09:28]--[2015-09-03 周四 09:53] =>  0:25
:END:
<2015-09-03 周四 09:27> 
** DONE practise the reindex mechanism
CLOSED: [2015-09-21 周一 11:09]
:LOGBOOK:
CLOCK: [2015-09-06 周日 15:55]--[2015-09-06 周日 16:49] =>  0:54
CLOCK: [2015-09-06 周日 15:25]--[2015-09-06 周日 15:50] =>  0:25
:END:
not completed reason : one part is the unknown network problem
** DONE learn the abnf and make notes well 
CLOSED: [2015-09-21 周一 10:47]
:LOGBOOK:
CLOCK: [2015-09-11 周五 13:43]--[2015-09-11 周五 14:10] =>  0:27
:END:
** DONE write the relevant ABNF based to the scenes from haizi
CLOSED: [2015-09-21 周一 10:43]
:LOGBOOK:
CLOCK: [2015-09-15 周二 10:49]--[2015-09-15 周二 11:14] =>  0:25
:END:
*** TODO upload es
:LOGBOOK:
CLOCK: [2015-09-22 周二 15:37]--[2015-09-22 周二 16:02] =>  0:25
:END:
** TODO set all fields store and index: mapping
:LOGBOOK:
CLOCK: [2015-09-24 周四 10:33]--[2015-09-24 周四 10:58] =>  0:25
:END:
- dynamic_templates :: "mappings" in one type
  - PUT /my_index
    {
        "mappings": {
            "type_name": {
                "dynamic_templates": [
                    { "store_generic": {
                          "match": "*",
                          "mapping": {
                              "store": true,
                              "index": "no"
                          }
                    }}
                ]
    }}}
- _default_ :: use in different types in one index 
** mongo connector wiki
:LOGBOOK:
CLOCK: [2015-09-30 周三 14:14]--[2015-09-30 周三 14:39] =>  0:25
CLOCK: [2015-09-30 周三 13:42]--[2015-09-30 周三 14:07] =>  0:25
:END:
- oplog process file
  - keep track of the lastest oplog 
- resync
